'''
http://uneex.org/Python/GeoPython2021/Homework_HelloWorld

Написать программу, которая выводит строку Hello, world (в точности)

Input:
(ввод не нужен)

Output:
Hello, world
'''
print('Hello world!')

